#include <iostream>

int main(int argc, char* argv[])
{
    /*Даны два числа A и B. Вам нужно вычислить их сумму A+B. 
    В этой задаче вам нужно читать из стандартного ввода и 
    выводить ответ в стандартный вывод*/

    int a, b;

    std::cin >> a >> b;

    std::cout << (a + b) << std::endl;
}